---
kind: event
id: E:Autodesk.Revit.UI.ComboBox.DropDownOpened
source: html/7c1f5209-2198-fc8d-4ce5-2f1fc1d8e5c5.htm
---
# Autodesk.Revit.UI.ComboBox.DropDownOpened Event

Subscribe to this event to be notified when the drop-down of the ComboBox is opened.

## Syntax (C#)
```csharp
public event EventHandler<ComboBoxDropDownOpenedEventArgs> DropDownOpened
```